{
    "model_type": "model2vec",
    "architectures": [
        "StaticModel"
    ],
    "tokenizer_name": "BAAI/bge-base-en-v1.5",
    "apply_pca": 64,
    "apply_zipf": null,
    "sif_coefficient": 0.0001,
    "hidden_dim": 64,
    "seq_length": 1000000,
    "normalize": true
}