{
  "backend": "tokenizers",
  "bos_token": "<|begin_of_text|>",
  "clean_up_tokenization_spaces": true,
  "eos_token": "<|end_of_text|>",
  "is_local": false,
  "mask_token": "<|mask|>",
  "max_length": null,
  "model_input_names": [
    "input_ids",
    "attention_mask"
  ],
  "model_max_length": 1000000000000000019884624838656,
  "pad_to_multiple_of": null,
  "pad_token": "<|pad|>",
  "pad_token_type_id": 0,
  "padding_side": "right",
  "processor_class": "LlavaEuroBertProcessor",
  "tokenizer_class": "TokenizersBackend",
  "auto_map": {
    "AutoProcessor": "processing_llava_eurobert.LlavaEuroBertProcessor"
  }
}